OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_hid/hid_core.c
static void  led_ctrl_irq(UTR_T *utr)
{
    // HID_DBGMSG("Set LED control xfer done.\n");
    utr->bIsTransferDone = 1;
}

int32_t  usbh_hid_set_report_non_blocking(HID_DEV_T *hdev, int rtp_typ, int rtp_id,
                                          uint8_t *data, int len)
{
    IFACE_T    *iface;
    UTR_T      *utr;
    int        status;

    if (!hdev || !hdev->iface)
    {
        return USBH_ERR_NOT_FOUND;
    }

    iface = (IFACE_T *)hdev->iface;

    utr = hdev->rpd.utr_led;

    if (utr == USBNULL)
    {
        utr = alloc_utr(iface->udev);

        if (utr == USBNULL)
        {
            return USBH_ERR_MEMORY_OUT;
        }

        hdev->rpd.utr_led = utr;
    }
    else
    {
        if (utr->bIsTransferDone == 0U)
        {
            return HID_RET_IO_ERR;        /* unlikely! the last LED control trnasfer is not completed */
        }
    }

    uint32_t u32ReqRequestType_tmp = (uint32_t)REQ_TYPE_OUT | (uint32_t)REQ_TYPE_CLASS_DEV | (uint32_t)REQ_TYPE_TO_IFACE;
    utr->setup.bmRequestType = (uint8_t)u32ReqRequestType_tmp;
    utr->setup.bRequest   = HID_REPORT_SET;
    utr->setup.wValue     = (uint16_t)((uint16_t)rtp_id + ((uint16_t)rtp_typ << 8U));
    utr->setup.wIndex     = iface->if_num;
    utr->setup.wLength    = len;

    utr->buff = data;
    utr->data_len = len;
    utr->func = led_ctrl_irq;
    utr->bIsTransferDone = 0;

    status = iface->udev->hc_driver->ctrl_xfer(utr);

    if (status < 0)
    {
        iface->udev->ep0.hw_pipe = USBNULL;
        return status;
    }

    return 0;
}

/// @endcond HIDDEN_SYMBOLS

/**
 * @brief  Issue a HID class GET_IDLE request. The GET_IDLE request
 *         reads the current idle rate for a particular Input report.
 *
 * @param[in] hdev       HID device pointer
 * @param[in] rtp_id     Report ID
 * @param[out] idle_rate An one byte buffer holds the reported idle rate.
 * @return   Success or not.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t  usbh_hid_get_idle(HID_DEV_T *hdev, int rtp_id, uint8_t *idle_rate)
{
    IFACE_T    *iface;
    uint32_t   xfer_len;
    int        ret;

    if (!hdev || !hdev->iface)
    {
        return USBH_ERR_NOT_FOUND;
    }

    iface = (IFACE_T *)hdev->iface;

    ret = usbh_ctrl_xfer(iface->udev,
                         REQ_TYPE_IN | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_IFACE,  /* bmRequestType */
                         HID_GET_IDLE,                  /* bRequest                              */
                         (uint16_t)(rtp_id),            /* wValue                                */
                         iface->if_num,                 /* wIndex                                */
                         1,                             /* wLength                               */
                         idle_rate, &xfer_len, USB_CTRL_TIMEOUT_MS);

    if ((ret < 0) || (xfer_len != 1U))
    {
        HID_DBGMSG("failed to get idle rate! %d\n", ret);
        return HID_RET_IO_ERR;
    }

    return HID_RET_OK;
}

/**
 * @brief  Issue a HID class SET_IDLE request. The SET_IDLE request
 *         silences a particular report on the Interrupt In pipe until a
 *         new event occurs or the specified amount of time passes.
 *
 * @param[in] hdev       HID device
 * @param[in] rtp_id     Report ID
 * @param[out] idle_rate The idle rate to be set.
 * @return   Success or not.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t  usbh_hid_set_idle(HID_DEV_T *hdev, int rtp_id, uint8_t idle_rate)
{
    IFACE_T    *iface;
    uint32_t   xfer_len;
    uint16_t   wValue = idle_rate;
    int        ret;

    if (!hdev || !hdev->iface)
    {
        return USBH_ERR_NOT_FOUND;
    }

    iface = (IFACE_T *)hdev->iface;

    ret = usbh_ctrl_xfer(iface->udev,
                         REQ_TYPE_OUT | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_IFACE, /* bmRequestType */
                         HID_SET_IDLE,                  /* bRequest                              */
                         (uint16_t)((uint32_t)rtp_id + ((uint32_t)wValue << 8U)),        /* wValue                                */
                         iface->if_num,                 /* wIndex                                */
                         0,                             /* wLength                               */
                         USBNULL, &xfer_len, USB_CTRL_TIMEOUT_MS);

    if (ret < 0)
    {
        HID_DBGMSG("failed to set idle rate! %d\n", ret);
        return HID_RET_IO_ERR;
    }

    return HID_RET_OK;
}

/**
 * @brief  Issue a HID class GET_PROTOCOL request. The GET_PROTOCOL
 *         request reads which protocol is currently active (either the boot
 *         protocol or the report protocol.)
 *
 * @param[in] hdev       HID device pointer
 * @param[out] protocol  An one byte buffer holds the protocol code.
 * @return   Success or not.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t  usbh_hid_get_protocol(HID_DEV_T *hdev, uint8_t *protocol)
{
    IFACE_T     *iface;
    uint32_t    xfer_len;
    int         ret;

    if (!hdev || !hdev->iface)
    {
        return USBH_ERR_NOT_FOUND;
    }

    iface = (IFACE_T *)hdev->iface;

    ret = usbh_ctrl_xfer(iface->udev,
                         REQ_TYPE_IN | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_IFACE,  /* bmRequestType */
                         HID_GET_PROTOCOL,              /* bRequest                              */
                         0,                             /* wValue                                */
                         iface->if_num,                 /* wIndex                                */
                         1,                             /* wLength                               */
                         protocol, &xfer_len, USB_CTRL_TIMEOUT_MS);

    if ((ret < 0) || (xfer_len != 1U))
    {
        HID_DBGMSG("failed to get idle rate! %d\n", ret);
        return HID_RET_IO_ERR;
    }

    return HID_RET_OK;
}

/**
 * @brief  Issue a HID class SET_PROTOCOL request. The SET_PROTOCOL
 *         switches between the boot protocol and the report protocol (or
 *         vice versa).
 *
 * @param[in] hdev       HID device pointer.
 * @param[in] protocol   The protocol to be set.
 * @return   Success or not.
 * @retval   0           Success
 * @retval   Otherwise   Failed
 */
int32_t  usbh_hid_set_protocol(HID_DEV_T *hdev, uint8_t protocol)
{
    IFACE_T    *iface;
    uint32_t   xfer_len;
    int        ret;

    if (!hdev || !hdev->iface)
    {
        return USBH_ERR_NOT_FOUND;
    }

    iface = (IFACE_T *)hdev->iface;

