OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_hid/hid_core.c
    ret = usbh_ctrl_xfer(iface->udev,
                         REQ_TYPE_OUT | REQ_TYPE_CLASS_DEV | REQ_TYPE_TO_IFACE, /* bmRequestType */
                         HID_SET_PROTOCOL,              /* bRequest                              */
                         protocol,                      /* wValue                                */
                         iface->if_num,                 /* wIndex                                */
                         0,                             /* wLength                               */
                         USBNULL, &xfer_len, USB_CTRL_TIMEOUT_MS);

    if (ret < 0)
    {
        HID_DBGMSG("failed to set idle rate! %d\n", ret);
        return HID_RET_IO_ERR;
    }

    return HID_RET_OK;
}

/// @cond HIDDEN_SYMBOLS

/*
 * HID int-in complete function
 */
static void  hid_read_irq(UTR_T *utr)
{
    HID_DEV_T   *hdev;
    int         ret;

    if (utr->status == USBH_ERR_ABORT)
    {
        return;
    }

    //HID_DBGMSG("hid_read_irq. %d\n", utr->xfer_len);

    hdev = (HID_DEV_T *)utr->context;

    if (utr->status != 0)
    {
        HID_DBGMSG("hid_read_irq - has error: 0x%x\n", utr->status);

        if (hdev->read_func)
        {
            hdev->read_func(hdev, utr->ep->bEndpointAddress, utr->status, utr->buff, 0);
        }

        return;
    }

    if (hdev->bSubClassCode == (uint8_t)HID_SUBCLASS_BOOT_DEVICE)
    {
        if (hdev->bProtocolCode == (uint8_t)HID_PROTOCOL_MOUSE)
        {
            (void)hid_parse_mouse_reports(hdev, utr->buff, utr->xfer_len);
        }

        if (hdev->bProtocolCode == (uint8_t)HID_PROTOCOL_KEYBOARD)
        {
            (void)hid_parse_keyboard_reports(hdev, utr->buff, utr->xfer_len);
        }
    }

    if (hdev->read_func && utr->xfer_len)
    {
        hdev->read_func(hdev, utr->ep->bEndpointAddress, utr->status, utr->buff, utr->xfer_len);
    }

    utr->xfer_len = 0;
    ret = usbh_int_xfer(utr);

    if (ret)
    {
        HID_DBGMSG("hid_read_irq - failed to submit interrupt-in request (%d)", ret);

        if (hdev->read_func)
        {
            hdev->read_func(hdev, utr->ep->bEndpointAddress, ret, utr->buff, 0);
        }

        (void)usbh_free_mem(utr->buff, utr->data_len);
        free_utr(utr);
    }
}

/*
 * HID int-out complete function
 */
static void  hid_write_irq(UTR_T *utr)
{
    HID_DEV_T     *hdev;
    int           ret;

    //HID_DBGMSG("hid_write_irq. %d\n", urb->actual_length);

    if (utr->status == USBH_ERR_ABORT)
    {
        return;
    }

    hdev = (HID_DEV_T *)utr->context;

    if (utr->status)
    {
        HID_DBGMSG("hid_write_irq - has error: 0x%x\n", utr->status);
        hdev->write_func(hdev, utr->ep->bEndpointAddress, utr->status, utr->buff, &(utr->data_len));
        return;
    }

    if (hdev->write_func)
    {
        utr->data_len = utr->ep->wMaxPacketSize;
        hdev->write_func(hdev, utr->ep->bEndpointAddress, utr->status, utr->buff, &(utr->data_len));
    }

    utr->xfer_len = 0;
    ret = usbh_int_xfer(utr);

    if (ret)
    {
        HID_DBGMSG("hid_write_irq - failed to submit interrupt-out request (%d)", ret);
        hdev->write_func(hdev, utr->ep->bEndpointAddress, ret, utr->buff, &(utr->data_len));
        free_utr(utr);
    }
}

/// @endcond HIDDEN_SYMBOLS

/**
 *  @brief  Start purge the USB interrupt in transfer.
 *  @param[in] hdev       HID device pointer.
 *  @param[in] ep_addr    Endpoint address. If ep_addr is 0, it will use the first found interrupt-in
 *                        endpoint. If ep_addr is not 0, it will use the specified endpoint if found.
 *  @param[in] func       The interrupt in data receiver callback function.
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int32_t usbh_hid_start_int_read(HID_DEV_T *hdev, uint8_t ep_addr, HID_IR_FUNC *func)
{
    IFACE_T    *iface = (IFACE_T *)hdev->iface;
    UTR_T      *utr;
    EP_INFO_T  *ep;
    int         i;
    int         ret;

    if ((!iface) || (!iface->udev))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    if (!func)
    {
        return HID_RET_INVALID_PARAMETER;
    }

    for (i = 0; i < CONFIG_HID_DEV_MAX_PIPE; i++)
    {
        utr = hdev->utr_list[i];

        if ((utr != USBNULL) && (utr->ep != USBNULL) && (utr->ep->bEndpointAddress == ep_addr))
        {
            return HID_RET_XFER_IS_RUNNING;      /* transfer of this pipe is running      */
        }
    }

    if (ep_addr == 0U)
    {
        ep = usbh_iface_find_ep(iface, 0, EP_ADDR_DIR_IN | EP_ATTR_TT_INT);
    }
    else
    {
        ep = usbh_iface_find_ep(iface, ep_addr, 0);
    }

    if (ep == USBNULL)
    {
        return USBH_ERR_EP_NOT_FOUND;
    }

    utr = alloc_utr(iface->udev);

    if (!utr)
    {
        return USBH_ERR_MEMORY_OUT;
    }

    utr->buff = usbh_alloc_mem(ep->wMaxPacketSize);

    if (utr->buff == USBNULL)
    {
        free_utr(utr);
        return USBH_ERR_MEMORY_OUT;
    }

    hdev->read_func = func;
    utr->context = hdev;
    utr->ep = ep;
    utr->data_len = ep->wMaxPacketSize;
    utr->xfer_len = 0;
    utr->func = hid_read_irq;

    ret = usbh_int_xfer(utr);

    if (ret < 0)
    {
        HID_DBGMSG("Error - failed to submit interrupt read request (%d)", ret);
        (void)usbh_free_mem(utr->buff, utr->data_len);
        free_utr(utr);
        return HID_RET_IO_ERR;
    }

    i = get_free_utr_slot(hdev);

    if (i < 0)
    {
        HID_DBGMSG("Error - No free HID slot!\n");
        (void)usbh_quit_utr(utr);
        (void)usbh_free_mem(utr->buff, utr->data_len);
        free_utr(utr);
        return USBH_ERR_MEMORY_OUT;         /* no free UTR slot.                          */
    }
    else
    {
        hdev->utr_list[i] = utr;
    }

    return HID_RET_OK;
}

/**
 *  @brief  Stop purge the USB interrupt in transfer.
 *  @param[in] hdev       HID device pointer
 *  @param[in] ep_addr    Endpoint address. If ep_addr is 0, it will use the first found interrupt-in
 *                        endpoint. If ep_addr is not 0, it will use the specified endpoint if found.
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int32_t usbh_hid_stop_int_read(HID_DEV_T *hdev, uint8_t ep_addr)
{
    const IFACE_T    *iface = (const IFACE_T *)hdev->iface;
    UTR_T      *utr = USBNULL;
    int        i;
    int        ret;

    if ((!iface) || (!iface->udev))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    for (i = 0; i < CONFIG_HID_DEV_MAX_PIPE; i++)
    {
        utr = hdev->utr_list[i];

