OpenNuvoton/M55M1BSP/Library/UsbHostLib/src_hid/hid_core.c
        if ((utr != USBNULL) && (utr->ep != USBNULL) &&
                (((ep_addr == 0U) && ((utr->ep->bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_IN)) ||
                 ((ep_addr != 0U) && (utr->ep->bEndpointAddress == ep_addr))))
        {
            break;
        }

        utr = USBNULL;
    }

    if ((utr == USBNULL) || (i >= CONFIG_HID_DEV_MAX_PIPE))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    hdev->utr_list[i] = USBNULL;               /* remove it from HID UTR list                */

    ret = usbh_quit_utr(utr);               /* force to stop the transfer                 */

    (void)usbh_free_mem(utr->buff, utr->ep->wMaxPacketSize);
    free_utr(utr);

    return ret;
}

/**
 *  @brief  Start purge the USB interrupt out transfer.
 *  @param[in] hdev       HID device pointer.
 *  @param[in] ep_addr    Endpoint address. If ep_addr is 0, it will use the first found interrupt-out
 *                        endpoint. If ep_addr is not 0, it will use the specified endpoint if found.
 *  @param[in] func       The interrupt in data transfer callback function.
 *  @return   Success or not.
 *  @retval   0           Success
 *  @retval   Otherwise   Failed
 */
int32_t usbh_hid_start_int_write(HID_DEV_T *hdev, uint8_t ep_addr, HID_IW_FUNC *func)
{
    IFACE_T    *iface = (IFACE_T *)hdev->iface;
    UTR_T      *utr;
    EP_INFO_T  *ep;
    int        i;
    int        ret;

    if ((!iface) || (!iface->udev))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    if (!func)
    {
        return HID_RET_INVALID_PARAMETER;
    }

    for (i = 0; i < CONFIG_HID_DEV_MAX_PIPE; i++)
    {
        utr = hdev->utr_list[i];

        if ((utr != USBNULL) && (utr->ep != USBNULL) && (utr->ep->bEndpointAddress == ep_addr))
        {
            return HID_RET_XFER_IS_RUNNING;      /* transfer of this pipe is running      */
        }
    }

    if (ep_addr == 0U)
    {
        ep = usbh_iface_find_ep(iface, 0, EP_ADDR_DIR_OUT | EP_ATTR_TT_INT);
    }
    else
    {
        ep = usbh_iface_find_ep(iface, ep_addr, 0);
    }

    if (ep == USBNULL)
    {
        return USBH_ERR_EP_NOT_FOUND;
    }

    utr = alloc_utr(iface->udev);

    if (!utr)
    {
        return USBH_ERR_MEMORY_OUT;
    }

    utr->buff = usbh_alloc_mem(ep->wMaxPacketSize);

    if (utr->buff == USBNULL)
    {
        free_utr(utr);
        return USBH_ERR_MEMORY_OUT;
    }

    hdev->write_func = func;

    utr->context = hdev;
    utr->ep = ep;
    utr->data_len = ep->wMaxPacketSize;
    utr->xfer_len = 0;
    utr->func = hid_write_irq;

    /* first time interrupt write call-back to get first data packet */
    func(hdev, ep->bEndpointAddress, 0, utr->buff, &(utr->data_len));

    ret = usbh_int_xfer(utr);

    if (ret < 0)
    {
        HID_DBGMSG("Error - failed to submit interrupt read request (%d)", ret);
        free_utr(utr);
        return HID_RET_IO_ERR;
    }

    i = get_free_utr_slot(hdev);

    if (i < 0)
    {
        HID_DBGMSG("Error - No free HID slot!\n");
        (void)usbh_quit_utr(utr);
        (void)usbh_free_mem(utr->buff, utr->data_len);
        free_utr(utr);
        return USBH_ERR_MEMORY_OUT;         /* no free UTR slot.                          */
    }
    else
    {
        hdev->utr_list[i] = utr;
    }

    return HID_RET_OK;
}

/**
 *  @brief  stop purge the USB interrupt out transfer.
 *  @param[in] hdev       HID device pointer
 *  @param[in] ep_addr    Endpoint address. If ep_addr is 0, it will use the first found interrupt-out
 *                        endpoint. If ep_addr is not 0, it will use the specified endpoint if found.
 *  @return   Success or not.
 *  @retval    0          Success
 *  @retval    Otherwise  Failed
 */
int32_t usbh_hid_stop_int_write(HID_DEV_T *hdev, uint8_t ep_addr)
{
    const IFACE_T    *iface = (const IFACE_T *)hdev->iface;
    UTR_T      *utr = USBNULL;
    int        i;
    int        ret;

    if ((!iface) || (!iface->udev))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    for (i = 0; i < CONFIG_HID_DEV_MAX_PIPE; i++)
    {
        utr = hdev->utr_list[i];

        if ((utr != USBNULL) && (utr->ep != USBNULL) &&
                (((ep_addr == 0U) && ((utr->ep->bEndpointAddress & EP_ADDR_DIR_MASK) == EP_ADDR_DIR_OUT)) ||
                 ((ep_addr != 0U) && (utr->ep->bEndpointAddress == ep_addr))))
        {
            break;
        }

        utr = USBNULL;
    }

    if ((utr == USBNULL) || (i >= CONFIG_HID_DEV_MAX_PIPE))
    {
        return HID_RET_DEV_NOT_FOUND;
    }

    hdev->utr_list[i] = USBNULL;               /* remove it from HID UTR list                */

    ret = usbh_quit_utr(utr);

    (void)usbh_free_mem(utr->buff, utr->ep->wMaxPacketSize);
    free_utr(utr);

    return ret;
}

/**
 * @brief  Register the mouse event callback function to HID class driver.
 *         Any mouse reports will be sent to user application via this callback.
 *
 * @param[in] func       Mouse event callback function
 * @return   None
 */
void  usbh_hid_regitser_mouse_callback(HID_MOUSE_FUNC *func)
{
    _mouse_callback = func;
}

/**
 * @brief Get the mouse event callback function registered to HID class driver.
 *
 * @return HID_MOUSE_FUNC pointer to the mouse event callback function
 */

HID_MOUSE_FUNC *usbh_hid_get_mouse_callback(void)
{
    return _mouse_callback;
}

/**
 * @brief  Register the keyboard event callback function to HID class driver.
 *         Any keyboard reports will be sent to user application via this callback.
 *
 * @param[in] func     Keyboard event callback function
 * @return   None
 */
void  usbh_hid_regitser_keyboard_callback(HID_KEYBOARD_FUNC *func)
{
    _keyboard_callback = func;
}


/**
 * @brief Get the keyboard event callback function registered to HID class driver.
 *
 * @return HID_KEYBOARD_FUNC pointer to the keyboard event callback function
 */
HID_KEYBOARD_FUNC *usbh_hid_get_keyboard_callback(void)
{
    return _keyboard_callback;
}